In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['First_Name','Last_Name','Email']
df

  First_Name Last_Name                    Email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [12]:
df.rename(columns={
    'first_name':'first',
    'last_name':'last'
},inplace = True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [15]:
df.loc[2] = ['John','Smith','Johnsmith@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      Johnsmith@email.com

In [17]:
df.loc[1,['first','last','email']] = ['umer','khan','umerkhan@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   umer     khan       umerkhan@email.com
2   John    Smith      Johnsmith@email.com

In [18]:
df.loc[2, 'last'] = 'Smith'

In [19]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   umer     khan       umerkhan@email.com
2   John    Smith      Johnsmith@email.com

In [20]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   umer     khan       umerkhan@email.com
2   John    Smith      Johnsmith@email.com

In [22]:
df['email'].apply(len)

0    23
1    18
2    19
Name: email, dtype: int64

In [29]:
def update_email(email):
    return email.upper()

In [30]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1         UMERKHAN@EMAIL.COM
2        JOHNSMITH@EMAIL.COM
Name: email, dtype: object

In [31]:
df['EMAIL'] = df['email'].apply(lambda x: x.upper())

In [32]:
df

   first     last                    email                    EMAIL
0  Corey  Schafer  CoreyMSchafer@gmail.com  COREYMSCHAFER@GMAIL.COM
1   umer     khan       umerkhan@email.com       UMERKHAN@EMAIL.COM
2   John    Smith      Johnsmith@email.com      JOHNSMITH@EMAIL.COM

In [33]:
df.apply(len, axis='columns')

0    4
1    4
2    4
dtype: int64

In [34]:
df.apply(len, axis=1)

0    4
1    4
2    4
dtype: int64

In [35]:
df.apply(lambda x: x.min())

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
EMAIL    COREYMSCHAFER@GMAIL.COM
dtype: object

In [36]:
df.applymap(str.lower)

   first     last                    email                    EMAIL
0  corey  schafer  coreymschafer@gmail.com  coreymschafer@gmail.com
1   umer     khan       umerkhan@email.com       umerkhan@email.com
2   john    smith      johnsmith@email.com      johnsmith@email.com

In [37]:
df

   first     last                    email                    EMAIL
0  Corey  Schafer  CoreyMSchafer@gmail.com  COREYMSCHAFER@GMAIL.COM
1   umer     khan       umerkhan@email.com       UMERKHAN@EMAIL.COM
2   John    Smith      Johnsmith@email.com      JOHNSMITH@EMAIL.COM

In [38]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1      NaN
2      NaN
Name: first, dtype: object

In [39]:
df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [40]:
df

   first     last                    email                    EMAIL
0  Chris  Schafer  CoreyMSchafer@gmail.com  COREYMSCHAFER@GMAIL.COM
1   umer     khan       umerkhan@email.com       UMERKHAN@EMAIL.COM
2   John    Smith      Johnsmith@email.com      JOHNSMITH@EMAIL.COM